ETL/Documents/ПлановыеДанныеОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПлановыеДанныеОтчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеДанныеОтчетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлановыеОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПлановыхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтрокиПлановыхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаСтрокиОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиСтрокПлановыхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ETL/Enums/ТипСальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипСальдо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ETL/Enums/ТипыАналитикиСтрокПлановыхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыАналитикиСтрокПлановыхОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Касса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НематериальныйАктив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резервы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипыАктивовИОбязательств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ETL/Catalogs/КлючиАналитикиСтрокПлановыхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиСтрокПлановыхОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СтрокиПлановыхОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>АналитикиСтрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыАналитикиСтрокПлановыхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Documents/ПлановыеДанныеОтчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьВидыОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОтчетовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ВидыОтчетов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДанныеОтчетов.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидОтчета", Элементы.ВидыОтчетов.ТекущиеДанные.ВидОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Не ФайлСохранен Тогда
		ДвоичныеДаннные = Новый ДвоичныеДанные(Объект.ФайлИмя);
		Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДаннные, ЭтотОбъект.УникальныйИдентификатор);
		СохранитьФайлНаСервере(Адрес);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СохранитьФайлНаСервере(Адрес)
	
	ФайлСохранен = Истина;
	ДвоичныеДаннные = ПолучитьИзВременногоХранилища(Адрес);
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.Файл = Новый ХранилищеЗначения(ДвоичныеДаннные, Новый СжатиеДанных(9));
	ТекОбъект.Записать();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОтчетов()
	
	ВидыОтчетов.Очистить();
		
	Если Объект.ДанныеОтчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокВидовОтчета = Объект.ДанныеОтчетов.Выгрузить(, "ВидОтчета");
	СписокВидовОтчета.Свернуть("ВидОтчета");
	
	ВидыОтчетов.Загрузить(СписокВидовОтчета);
	
	Элементы.ДанныеОтчетов.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидОтчета", ВидыОтчетов[0].ВидОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмяНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
	
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;	
	Объект.ФайлИмя	=	МассивФайлов[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение						=	Новый ОписаниеОповещения("ФайлИмяНачалоВыбораЗавершение", ЭтаФорма);   
    ДиалогВыбора					=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);   
	ДиалогВыбора.МножественныйВыбор	= 	Ложь;
    ДиалогВыбора.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмяОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ФайлИмя = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокумент(Команда)
	
	Объект.ДанныеОтчетов.Очистить();
	АдресФайлаВоВременномХранилище = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлИмя) Тогда
		НачатьПомещениеФайла(ОписаниеОповещения, АдресФайлаВоВременномХранилище,Нстр("ru = 'Файл загрузки'"),, УникальныйИдентификатор);
	Иначе
		НачатьПомещениеФайла(ОписаниеОповещения, АдресФайлаВоВременномХранилище,Объект.ФайлИмя,ложь, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
процедура ЗагрузитьДанныеЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	
	Если Результат Тогда
		
		Файл = Новый Файл(ВыбранноеИмяФайла);
		Если Не Файл.Существует() Тогда
			
			ТекстСообщения = Нстр("ru = 'Указанный файл не существует'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, "");
			Возврат;
			
		КонецЕсли;
		
		ЗагрузитьДанныеНаСервере(Адрес, Файл.Расширение, ДополнительныеПараметры);
		//ЭтаФорма.Прочитать();
	конецесли;
конецпроцедуры


&НаСервере
Процедура ЗагрузитьДанныеНаСервере(АдресФайлаВоВременномХранилище, Расширение, ДополнительныеПараметры)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщить("Произошла ошибка при обращение к Excel:" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	
	Попытка		
		//Excel = Новый COMОбъект("Excel.Application");
		//Excel.WorkBooks.Open(Объект.ФайлИмя);
		
		ЗагрузитьСтраницуДивиденды(ТабДок);
		ЗагрузитьСтраницуCF(ТабДок);
		ЗагрузитьСтраницуBS(ТабДок);
		ЗагрузитьСтраницуФинансовыеДоходыИРасходы(ТабДок);
		ЗагрузитьСтраницуКапитальныеЗатраты(ТабДок);
		ЗагрузитьСтраницуОперационныеДоходы(ТабДок);
		ЗагрузитьСтраницуОперационныеРасходы(ТабДок);  
		ЗагрузитьСтраницуФОТ(ТабДок);
		ЗагрузитьСтраницуПрочиеДоходыИРасходы(ТабДок);
		ЗагрузитьСтраницуКПНиНДС(ТабДок);
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		//Excel.DisplayAlerts	=	0; 
		//Excel.Quit();
		//Excel.DisplayAlerts	=	1;
	Исключение
	КонецПопытки;

	СвернутьДанныеОтчетовНаСервере();
	ЗаполнитьВидыОтчетов();
	ФайлСохранен = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗагрузкиПриИзменении(Элемент)
	
	Объект.ПериодЗагрузки = НачалоГода(Объект.ПериодЗагрузки);	
	
КонецПроцедуры

&НаСервере
Процедура СвернутьДанныеОтчетовНаСервере()
	тз = Объект.ДанныеОтчетов.Выгрузить();
	тз.Свернуть("ВидОтчета,СтрокаОтчета,АналитикаСтрокиОтчета,Валюта,Период", "Сумма,Количество");
	Объект.ДанныеОтчетов.Загрузить(тз);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.ПлановыеДанныеОтчетов.Форма.ФормаВыбораОрганизации",, Элемент, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

//Общие загрузка
&НаСервере
Функция ПолучитьСтрокуОтчета(ВидОтчета, Наименование, НаименованиеРодителя = "", ТипСальдо = "Дт")
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтрокиПлановыхОтчетов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СтрокиПлановыхОтчетов КАК СтрокиПлановыхОтчетов
	               |ГДЕ
	               |	СтрокиПлановыхОтчетов.Наименование = &Наименование
	               |	И СтрокиПлановыхОтчетов.Владелец = &Владелец
	               |	И СтрокиПлановыхОтчетов.ТипСальдо = &ТипСальдо
	               |	И ЕСТЬNULL(СтрокиПлановыхОтчетов.Родитель.Наименование, """") = &НаименованиеРодителя";
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТипСальдо", Перечисления.ТипСальдо[ТипСальдо]);
	Запрос.УстановитьПараметр("НаименованиеРодителя", НаименованиеРодителя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Если НаименованиеРодителя = "" Тогда
			Родитель = Справочники.СтрокиПлановыхОтчетов.ПустаяСсылка();
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтрокиПлановыхОтчетов.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.СтрокиПлановыхОтчетов КАК СтрокиПлановыхОтчетов
			               |ГДЕ
			               |	СтрокиПлановыхОтчетов.ЭтоГруппа
			               |	И СтрокиПлановыхОтчетов.Наименование = &НаименованиеРодителя";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Родитель = Выборка.Ссылка;
			Иначе
				НовРодитель = Справочники.СтрокиПлановыхОтчетов.СоздатьГруппу();
				НовРодитель.Наименование = НаименованиеРодителя;
				НовРодитель.Владелец = ВидОтчета;
				НовРодитель.Записать();
				Родитель = НовРодитель.Ссылка;
			КонецЕсли;
		КонецЕсли;
		НовСтрока = Справочники.СтрокиПлановыхОтчетов.СоздатьЭлемент();
		НовСтрока.Наименование = Наименование;
		НовСтрока.ТипСальдо = Перечисления.ТипСальдо[ТипСальдо];
		НовСтрока.Владелец = ВидОтчета;
		НовСтрока.Родитель = Родитель;
		НовСтрока.Записать();
		Возврат НовСтрока.Ссылка;
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьКлючАналитики(СтрокаОтчета, Ключи = Неопределено)
	
	Если Ключи = Неопределено Тогда
		Ключи = Новый Структура;
		Ключи.Вставить("Строка", "Без аналитики");
	КонецЕсли;
	
	ШаблонЗапроса = "ВЫБРАТЬ
	                |	КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Ссылка,
					|	Сумма(1) КАК Совпадений
					|	Поместить ВТ_Ссылки
	                |ИЗ
	                |	Справочник.КлючиАналитикиСтрокПлановыхОтчетов.АналитикиСтрок КАК КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок
	                |ГДЕ
	                |	КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Аналитика = &#Аналитика
	                |	И КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Ссылка.Владелец = &Владелец
	                |	И КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.ТипАналитики = &#ТипАналитики
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Ссылка";
	ШаблонЗапроса1 = "ВЫБРАТЬ
	                |	КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Ссылка,
					|	Сумма(1) КАК Совпадений
	                |ИЗ
	                |	Справочник.КлючиАналитикиСтрокПлановыхОтчетов.АналитикиСтрок КАК КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок
	                |ГДЕ
	                |	КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Аналитика = &#Аналитика
	                |	И КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Ссылка.Владелец = &Владелец
	                |	И КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.ТипАналитики = &#ТипАналитики
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	КлючиАналитикиСтрокПлановыхОтчетовАналитикиСтрок.Ссылка";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", СтрокаОтчета);

	Н = 1;
	
	Для Каждого Ключ Из Ключи Цикл	
		
		СтрокаАналитика = "Аналитика" + Формат(Н, "ЧГ=0");
		СтрокаТипАналитики = "ТипАналитики" + Формат(Н, "ЧГ=0");
		
		Если Запрос.Текст = "" Тогда	
			ТекШаблон = СтрЗаменить(ШаблонЗапроса, "#Аналитика", СтрокаАналитика); 
			ТекШаблон = СтрЗаменить(ТекШаблон, "#ТипАналитики", СтрокаТипАналитики);
		

			Запрос.Текст = ТекШаблон;
		Иначе
			ТекШаблон = СтрЗаменить(ШаблонЗапроса1, "#Аналитика", СтрокаАналитика); 
			ТекШаблон = СтрЗаменить(ТекШаблон, "#ТипАналитики", СтрокаТипАналитики);
			Запрос.Текст = Запрос.Текст + "
				|
	        	|ОБЪЕДИНИТЬ ВСЕ
	      		|
				|" + ТекШаблон;
		КонецЕсли;
	
		Запрос.УстановитьПараметр(СтрокаАналитика, Ключ.Значение);
		Если Лев(Ключ.Ключ, 6) = "Строка" Тогда
			ТипАналитики = Перечисления.ТипыАналитикиСтрокПлановыхОтчетов.Строка;
		Иначе
			ТипАналитики = Перечисления.ТипыАналитикиСтрокПлановыхОтчетов[Ключ.Ключ];
		КонецЕсли;
		Запрос.УстановитьПараметр(СтрокаТипАналитики, ТипАналитики);
		
		Н = Н + 1;
		
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
	|;
	|/////////////////
	|ВЫБРАТЬ
	|	ВТ_Ссылки.Ссылка КАК Ссылка,
	|	СУММА(ВТ_Ссылки.Совпадений) КАК Совпадений
	|ИЗ
	|	ВТ_Ссылки КАК ВТ_Ссылки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Ссылки.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Совпадений УБЫВ";
	


	
	//МассивПроверенных = Новый Массив;
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	совпадений = 0;
	Пока Выборка.Следующий() Цикл
		если Выборка.совпадений<совпадений тогда
			прервать;
		конецесли;
		совпадений = Выборка.совпадений;
		//Если МассивПроверенных.Найти(Выборка.Ссылка) = Неопределено Тогда
			ТЗАналитики = Выборка.Ссылка.АналитикиСтрок.Выгрузить();
			ВсеКлючи = Истина;
			Для Каждого Ключ Из Ключи Цикл
				Если Лев(Ключ.Ключ, 6) = "Строка" Тогда
					ТипАналитики = Перечисления.ТипыАналитикиСтрокПлановыхОтчетов.Строка;
				Иначе
					ТипАналитики = Перечисления.ТипыАналитикиСтрокПлановыхОтчетов[Ключ.Ключ];
				КонецЕсли;
				СтрокиПоиска = ТЗАналитики.НайтиСтроки(Новый Структура("Аналитика, ТипАналитики", Ключ.Значение, ТипАналитики));
				Если СтрокиПоиска.Количество() = 0 Тогда
					//МассивПроверенных.Добавить(Выборка.Ссылка);
					ВсеКлючи = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ВсеКлючи Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	
	НовАналитика = Справочники.КлючиАналитикиСтрокПлановыхОтчетов.СоздатьЭлемент();
	НовАналитика.Владелец = СтрокаОтчета;
	
	Наименование = "";
	Для Каждого Ключ Из Ключи Цикл
		НовСтрока = НовАналитика.АналитикиСтрок.Добавить();		
		НовСтрока.Аналитика = Ключ.Значение;
		Если Лев(Ключ.Ключ, 6) = "Строка" Тогда
			ТипАналитики = Перечисления.ТипыАналитикиСтрокПлановыхОтчетов.Строка;
		Иначе
			ТипАналитики = Перечисления.ТипыАналитикиСтрокПлановыхОтчетов[Ключ.Ключ];
		КонецЕсли;
		НовСтрока.ТипАналитики = ТипАналитики;
		Наименование = Наименование + Ключ.Значение + ";";
	КонецЦикла;
	
	НовАналитика.Наименование = СокрЛП(Лев(Наименование, 150));
	НовАналитика.Записать();
	Возврат НовАналитика.Ссылка;
	
КонецФункции

Функция ПолучитьПериод(Значение)
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Дата(Значение, 1, 1);
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		СтрокаМесяц = ВРег(Лев(Значение, 3));
		Если СтрокаМесяц = "ЯНВ" Тогда
			Месяц = 1;
		ИначеЕсли СтрокаМесяц = "ФЕВ" Тогда
			Месяц = 2;
		ИначеЕсли СтрокаМесяц = "МАР" Тогда
			Месяц = 3;
		ИначеЕсли СтрокаМесяц = "АПР" Тогда
			Месяц = 4;
		ИначеЕсли СтрокаМесяц = "МАЙ" Тогда
			Месяц = 5;
		ИначеЕсли СтрокаМесяц = "ИЮН" Тогда
			Месяц = 6;
		ИначеЕсли СтрокаМесяц = "ИЮЛ" Тогда
			Месяц = 7;
		ИначеЕсли СтрокаМесяц = "АВГ" Тогда
			Месяц = 8;
		ИначеЕсли СтрокаМесяц = "СЕН" Тогда
			Месяц = 9;
		ИначеЕсли СтрокаМесяц = "ОКТ" Тогда
			Месяц = 10;
		ИначеЕсли СтрокаМесяц = "НОЯ" Тогда
			Месяц = 11;
		ИначеЕсли СтрокаМесяц = "ДЕК" Тогда
			Месяц = 12;
		Иначе
			Возврат Дата(1,1,1);
		КонецЕсли;
		Возврат Дата(Год(Объект.ПериодЗагрузки), Месяц, 1); 
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЧисло(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда	
		СтрокаОбработка = СтрЗаменить(Значение, Символы.НПП, "");
		СтрокаОбработка = СтрЗаменить(СтрокаОбработка, Символы.Таб, "");
		СтрокаОбработка = СтрЗаменить(СтрокаОбработка, " ", "");
		
		Попытка     
			Число = Число(СтрокаОбработка);
		Исключение
			Число = 0;
		КонецПопытки;
		
		Возврат Число;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
//Общие загрузка

//Дивиденды
//&НаКлиенте
Процедура ЗагрузитьСтраницуДивиденды(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("Дивиденды___Курсовая_разница");
	Исключение
		Возврат;
	КонецПопытки;
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;

	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.Дивиденды");

	Для Н = 3 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(Н, 2).Text) = "" Тогда
			Прервать;
		КонецЕсли;
		ЗагрузитьСтрокуДивиденды(ТекОтчет, Н, ВидОтчета);	
	КонецЦикла;
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуДивиденды(ТекОтчет, Строка, ВидОтчета)
	
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, СокрЛП(ТекОтчет.Область(Строка,2).текст));
	КлючАналитики = Неопределено;
	
	Для Н = 3 По 15 Цикл
		Если ТекОтчет.Область(2, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(2, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(2, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
//Дивиденды

//CF
//&НаКлиенте
Процедура ЗагрузитьСтраницуCF(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("CF");
	Исключение
		Возврат;
	КонецПопытки;
	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.ОтчетОДвиженииДенежныхСредств");
		
	//ДВИЖЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ ОТ ОПЕРАЦИОННОЙ ДЕЯТЕЛЬНОСТИ
	Для М = 8 По 12 Цикл			
		ЗагрузитьСтрокуCF(ТекОтчет, М, СокрЛП(ТекОтчет.Область(6, 1).текст), "Дт", ВидОтчета);		
	КонецЦикла;	
	Для М = 15 По 20 Цикл		
		ЗагрузитьСтрокуCF(ТекОтчет, М, СокрЛП(ТекОтчет.Область(6, 1).текст), "Кт", ВидОтчета);	
	КонецЦикла;	
	//ДВИЖЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ ОТ ИНВЕСТИЦИОННОЙ ДЕЯТЕЛЬНОСТИ
	Для М = 27 По 31 Цикл			
		ЗагрузитьСтрокуCF(ТекОтчет, М, СокрЛП(ТекОтчет.Область(24, 1).текст), "Дт", ВидОтчета);		
	КонецЦикла;	
	Для М = 34 По 38 Цикл		
		ЗагрузитьСтрокуCF(ТекОтчет, М, СокрЛП(ТекОтчет.Область(24, 1).текст), "Кт", ВидОтчета);	
	КонецЦикла;
	//ДВИЖЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ ОТ ФИНАНСОВОЙ ДЕЯТЕЛЬНОСТИ
	Для М = 45 По 48 Цикл			
		ЗагрузитьСтрокуCF(ТекОтчет, М, СокрЛП(ТекОтчет.Область(42, 1).текст), "Дт", ВидОтчета);		
	КонецЦикла;	
	Для М = 51 По 54 Цикл		
		ЗагрузитьСтрокуCF(ТекОтчет, М, СокрЛП(ТекОтчет.Область(42, 1).текст), "Кт", ВидОтчета);	
	КонецЦикла;
	//Денежные средства и их эквиваленты на начало отчетного периода
	
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, СокрЛП(ТекОтчет.Область(58, 1).текст),, "Дт");
			
	Ключи = Новый Структура;
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(5, 2).текст)); 
		
	Если ТекОтчет.Область(6, 2).СодержитЗначение Тогда 
		Период = ПолучитьПериод(ТекОтчет.Область(6, 2).Значение);
	Иначе 
		Период = ПолучитьПериод(ТекОтчет.Область(6, 2).текст);
	КонецЕсли;
	Если ТекОтчет.Область(58, 2).СодержитЗначение Тогда 
		Сумма = ПолучитьЧисло(ТекОтчет.Область(58, 2).Значение);
	Иначе 
		Сумма = ПолучитьЧисло(ТекОтчет.Область(58, 2).текст);
	КонецЕсли;
	
	Если Сумма <> 0 Тогда
		КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);

		НовСтрока = Объект.ДанныеОтчетов.Добавить();
		НовСтрока.ВидОтчета = ВидОтчета;
		НовСтрока.СтрокаОтчета = СтрокаОтчета;
		НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
		НовСтрока.Период = Период;
		НовСтрока.Сумма = Сумма;
		НовСтрока.Валюта = "KZT";
	КонецЕсли;
		
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуCF(ТекОтчет, Строка, Родитель, ТипСальдо, ВидОтчета)
	
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, СокрЛП(ТекОтчет.Область(Строка, 1).текст), Родитель, ТипСальдо);
	
	Если ТекОтчет.Область(6, 2).СодержитЗначение Тогда 
		Период = ПолучитьПериод(ТекОтчет.Область(6, 2).Значение);
	Иначе 
		Период = ПолучитьПериод(ТекОтчет.Область(6, 2).текст);
	КонецЕсли;
	Если ТекОтчет.Область(Строка, 2).СодержитЗначение Тогда 
		Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, 2).Значение);
	Иначе 
		Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, 2).текст);
	КонецЕсли;
	
	Если Сумма <> 0 Тогда
		Ключи = Новый Структура;
		Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(5, 2).Text)); 
		КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
	
		НовСтрока = Объект.ДанныеОтчетов.Добавить();
		НовСтрока.ВидОтчета = ВидОтчета;
		НовСтрока.СтрокаОтчета = СтрокаОтчета;
		НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
		НовСтрока.Период = Период;
		НовСтрока.Сумма = Сумма;
		НовСтрока.Валюта = "KZT";
	КонецЕсли;
	
	Ключи = Новый Структура;
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(5, 3).Text)); 
	КлючАналитики = Неопределено;
		
	Для Н = 3 По 14 Цикл
		Если ТекОтчет.Область(6, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//CF

//BS
//&НаКлиенте
Процедура ЗагрузитьСтраницуBS(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("BS");
	Исключение
		Возврат;
	КонецПопытки;
	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.БухгалтерскийБаланс");
	
	//АКТИВЫ
	//Долгосрочные активы
	Для М = 9 По 12 Цикл			
		ЗагрузитьСтрокуBS(ТекОтчет, М, СокрЛП(ТекОтчет.Область(8, 1).Text), ВидОтчета);		
	КонецЦикла;	
	//Краткосрочные активы
	Для М = 15 По 20 Цикл		
		ЗагрузитьСтрокуBS(ТекОтчет, М, СокрЛП(ТекОтчет.Область(14, 1).Text), ВидОтчета);	
	КонецЦикла;	
	//КАПИТАЛ И ОБЯЗАТЕЛЬСТВА
	//Капитал
	Для М = 27 По 29 Цикл			
		ЗагрузитьСтрокуBS(ТекОтчет, М, СокрЛП(ТекОтчет.Область(26, 1).Text), ВидОтчета);		
	КонецЦикла;	
	//Долгосрочные обязательства
	Для М = 32 По 33 Цикл		
		ЗагрузитьСтрокуBS(ТекОтчет, М, СокрЛП(ТекОтчет.Область(31, 1).Text), ВидОтчета);	
	КонецЦикла;
	//Краткосрочные обязательства
	Для М = 36 По 40 Цикл			
		ЗагрузитьСтрокуBS(ТекОтчет, М, СокрЛП(ТекОтчет.Область(35, 1).Text), ВидОтчета);		
	КонецЦикла;	
			
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуBS(ТекОтчет, Строка, Родитель, ВидОтчета)
	
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, СокрЛП(ТекОтчет.Область(Строка, 1).Text), Родитель);	
	КлючАналитики = Неопределено;
	
	Для Н = 2 По 3 Цикл
		
		Если ТекОтчет.Область(6, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда 
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
//BS

//Финансовые доходы и расходы
//&НаКлиенте
Процедура ЗагрузитьСтраницуФинансовыеДоходыИРасходы(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("Финансовые_доходы_и_расходы");
	Исключение
		Возврат;
	КонецПопытки;	
	ВсегоСтрок = ТекОтчет.высотатаблицы;
	
//	ВсегоСтрок = Excel.Cells(1,1).SpecialCells(11).Row;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.ФинансовыеДоходыИРасходы");
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, "Строка отчета");

	Для М = 7 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 3).Text) = "Финансовые ковенанты, определенные кредитором" Тогда
			Прервать;
		КонецЕсли;
		ЗагрузитьСтрокуФинансовыеДоходыИРасходы(ТекОтчет, М, ВидОтчета, СтрокаОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуФинансовыеДоходыИРасходы(ТекОтчет, Строка, ВидОтчета, СтрокаОтчета)
		
	Ключи = Новый Структура;
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 3).Text));
	Ключи.Вставить("Договор", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(5, 18).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 12 По 23 Цикл
		
		Если ТекОтчет.Область(6, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 3).Text));
	Ключи.Вставить("Договор", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(5, 25).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 25 По 36 Цикл
		
		Если ТекОтчет.Область(6, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 3).Text));
	Ключи.Вставить("Договор", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(5, 38).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 38 По 49 Цикл
		
		Если ТекОтчет.Область(6, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(6, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;

			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
//Финансовые доходы и расходы

//Капитальные затраты
//&НаКлиенте
Процедура ЗагрузитьСтраницуКапитальныеЗатраты(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("Капитальные_затраты");
	Исключение
		Возврат;
	КонецПопытки;	
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.КапитальныеЗатраты");
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, "Строка отчета");

	Для М = 8 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 4).Text) = "" Тогда
			Прервать;
		КонецЕсли;
		ЗагрузитьСтрокуКапитальныеЗатраты(ТекОтчет, М, ВидОтчета, СтрокаОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуКапитальныеЗатраты(ТекОтчет, Строка, ВидОтчета, СтрокаОтчета)
		
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 11).Text));
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(6, 14).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 14 По 25 Цикл
		
		Если ТекОтчет.Область(7, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;

			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 11).Text));
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(6, 28).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 28 По 39 Цикл
		
		Если ТекОтчет.Область(7, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 11).Text));
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(6, 42).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 42 По 53 Цикл
		
		Если ТекОтчет.Область(7, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//Капитальные затраты

//Операционные доходы
//&НаКлиенте
Процедура ЗагрузитьСтраницуОперационныеДоходы(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("Операционные_доходы");
	Исключение
		Возврат;
	КонецПопытки;	
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.ОперационныеДоходы");
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, "Строка отчета");

	Для М = 8 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 4).Text) = "#Н/Д" Или СокрЛП(ТекОтчет.Область(М, 4).Text) = "" Тогда
			Продолжить;
		КонецЕсли;
		ЗагрузитьСтрокуОперационныеДоходы(ТекОтчет, М, ВидОтчета, СтрокаОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуОперационныеДоходы(ТекОтчет, Строка, ВидОтчета, СтрокаОтчета)
	
	Ключи = Новый Структура;
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Доходы", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(6, 41).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 41 По 52 Цикл
		
		Если ТекОтчет.Область(7, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;

			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Доходы", СокрЛП(ТекОтчет.Область(Строка, 4).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(6, 56).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 56 По 67 Цикл
		
		Если ТекОтчет.Область(7, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
//Операционные доходы

//Операционные расходы
//&НаКлиенте
Процедура ЗагрузитьСтраницуОперационныеРасходы(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("Операционные_расходы");
	Исключение
		Возврат;
	КонецПопытки;	
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.ОперационныеРасходы");
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, "Строка отчета");

	Для М = 9 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 9).Text) = "#Н/Д" Или СокрЛП(ТекОтчет.Область(М, 9).Text) = "" Тогда
			Продолжить;
		КонецЕсли;
		ЗагрузитьСтрокуОперационныеРасходы(ТекОтчет, М, ВидОтчета, СтрокаОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуОперационныеРасходы(ТекОтчет, Строка, ВидОтчета, СтрокаОтчета)
	
	Ключи = Новый Структура;
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Расходы", СокрЛП(ТекОтчет.Область(Строка, 9).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 10).Text));
	Ключи.Вставить("Номенклатура", СокрЛП(ТекОтчет.Область(Строка, 12).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(7, 47).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 47 По 58 Цикл
		
		Если ТекОтчет.Область(8, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н-28).СодержитЗначение Тогда 
			Количество = ПолучитьЧисло(ТекОтчет.Область(Строка, Н-28).Значение);
		Иначе 
			Количество = ПолучитьЧисло(ТекОтчет.Область(Строка, Н-28).текст);
		КонецЕсли;
		
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Количество = Количество;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Расходы", СокрЛП(ТекОтчет.Область(Строка, 9).Text));
	Ключи.Вставить("Контрагент", СокрЛП(ТекОтчет.Область(Строка, 10).Text));
	Ключи.Вставить("Номенклатура", СокрЛП(ТекОтчет.Область(Строка, 12).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(7, 61).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 61 По 72 Цикл
		
		Если ТекОтчет.Область(8, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н-42).СодержитЗначение Тогда 
			Количество = ПолучитьЧисло(ТекОтчет.Область(Строка, Н-42).Значение);
		Иначе 
			Количество = ПолучитьЧисло(ТекОтчет.Область(Строка, Н-42).текст);
		КонецЕсли;
		
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;

			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Количество = Количество;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
//Операционные расходы

//ФОТ
//&НаКлиенте
Процедура ЗагрузитьСтраницуФОТ(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("ФОТ");
	Исключение
		Возврат;
	КонецПопытки;	
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.ФОТ");
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, "Строка отчета");

	Для М = 14 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 4).Text) = "" Тогда
			Прервать;
		КонецЕсли;
		ЗагрузитьСтрокуФОТ(ТекОтчет, М, ВидОтчета, СтрокаОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуФОТ(ТекОтчет, Строка, ВидОтчета, СтрокаОтчета)
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));		
	Ключи.Вставить("Подразделение", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("ФизЛицо", СокрЛП(ТекОтчет.Область(Строка, 6).Text));
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(12, 30).Text));
		
	Если ТекОтчет.Область(Строка, 30).СодержитЗначение Тогда 
		Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, 30).Значение);
	Иначе 
		Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, 30).текст);
	КонецЕсли;
	Период = Объект.ПериодЗагрузки;

		
	Если Сумма <> 0 Тогда
		КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
		
		НовСтрока = Объект.ДанныеОтчетов.Добавить();
		НовСтрока.ВидОтчета = ВидОтчета;
		НовСтрока.СтрокаОтчета = СтрокаОтчета;
		НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
		НовСтрока.Период = Период;
		НовСтрока.Сумма = Сумма;
		НовСтрока.Валюта = "KZT";
	КонецЕсли;
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));		
	Ключи.Вставить("Подразделение", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("ФизЛицо", СокрЛП(ТекОтчет.Область(Строка, 6).Text));
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(12, 33).Text));

	Для Н = 33 По 36 Цикл
		Ключи.Вставить("Строка4", СокрЛП(ТекОтчет.Область(13, Н).Text));
		
		Период = Объект.ПериодЗагрузки;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
			
		Если Сумма <> 0 Тогда
			КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));		
	Ключи.Вставить("Подразделение", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("ФизЛицо", СокрЛП(ТекОтчет.Область(Строка, 6).Text));
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));

	Для Н = 38 По 43 Цикл
		Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(12, Н).Text));
		
		Период = Объект.ПериодЗагрузки;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
			
			
		Если Сумма <> 0 Тогда
			КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));		
	Ключи.Вставить("Подразделение", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("ФизЛицо", СокрЛП(ТекОтчет.Область(Строка, 6).Text));
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(12, 44).Text));

	Для Н = 44 По 49 Цикл
		Ключи.Вставить("Строка4", СокрЛП(ТекОтчет.Область(13, Н).Text));
		
		Период = Объект.ПериодЗагрузки;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
			
		Если Сумма <> 0 Тогда
			КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));		
	Ключи.Вставить("Подразделение", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("ФизЛицо", СокрЛП(ТекОтчет.Область(Строка, 6).Text));
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(12, 50).Text));

	Для Н = 50 По 55 Цикл
		Ключи.Вставить("Строка4", СокрЛП(ТекОтчет.Область(13, Н).Text));
		
		Период = Объект.ПериодЗагрузки;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
			
		Если Сумма <> 0 Тогда
			КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;
	
	Ключи = Новый Структура;
	Ключи.Вставить("СДДС", СокрЛП(ТекОтчет.Область(Строка, 4).Text));		
	Ключи.Вставить("Подразделение", СокрЛП(ТекОтчет.Область(Строка, 5).Text));
	Ключи.Вставить("ФизЛицо", СокрЛП(ТекОтчет.Область(Строка, 6).Text));
	Ключи.Вставить("Строка1", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	Ключи.Вставить("Строка2", СокрЛП(ТекОтчет.Область(Строка, 7).Text));
	Ключи.Вставить("Строка3", СокрЛП(ТекОтчет.Область(12, 56).Text));

	Для Н = 56 По 60 Цикл
		Ключи.Вставить("Строка4", СокрЛП(ТекОтчет.Область(13, Н).Text));
		
		Период = Объект.ПериодЗагрузки;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
			
		Если Сумма <> 0 Тогда
			КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//ФОТ

//Прочие доходы и расходы
//&НаКлиенте
Процедура ЗагрузитьСтраницуПрочиеДоходыИРасходы(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("Прочие_доходы_и_расходы");
	Исключение
		Возврат;
	КонецПопытки;	
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.ПрочиеДоходыИРасходы");
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, "Строка отчета");

	Для М = 9 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 2).Text) = "" Тогда
			Продолжить;
		КонецЕсли;
		ЗагрузитьСтрокуПрочиеДоходыИРасходы(ТекОтчет, М, ВидОтчета, СтрокаОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуПрочиеДоходыИРасходы(ТекОтчет, Строка, ВидОтчета, СтрокаОтчета)
	
	Если СокрЛП(ТекОтчет.Область(Строка, 1).Text) = "доход" Тогда
		ЭтоДоход = Истина;
	Иначе
		ЭтоДоход = Ложь;
	КонецЕсли;

	Ключи = Новый Структура;
	Если ЭтоДоход Тогда
		Ключи.Вставить("Доходы", СокрЛП(ТекОтчет.Область(Строка, 2).Text));	
	Иначе		
		Ключи.Вставить("Расходы", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	КонецЕсли;	
	
	КлючАналитики = Неопределено;
	
	Для Н = 4 По 15 Цикл
		
		Если ТекОтчет.Область(8, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;

			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;	
	
	Ключи = Новый Структура;
	Если ЭтоДоход Тогда
		Ключи.Вставить("Доходы", СокрЛП(ТекОтчет.Область(Строка, 2).Text));	
	Иначе		
		Ключи.Вставить("Расходы", СокрЛП(ТекОтчет.Область(Строка, 2).Text));
	КонецЕсли;	
	Ключи.Вставить("Строка", СокрЛП(ТекОтчет.Область(7, 33).Text));
	
	КлючАналитики = Неопределено;
	
	Для Н = 33 По 44 Цикл
		
		Если ТекОтчет.Область(8, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(8, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		Если НЕ ЭтоДоход Тогда
			Сумма = Сумма * (-1);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;
			
			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры
//Прочие доходы и расходы

//КПН и НДС
//&НаКлиенте
Процедура ЗагрузитьСтраницуКПНиНДС(ТабДок)
	
	Попытка
		ТекОтчет = ТабДок.ПолучитьОбласть("КПН_и_НДС");
	Исключение
		Возврат;
	КонецПопытки;	
	
	ВсегоСтрок = ТекОтчет.высотатаблицы;





	
	ВидОтчета = ПредопределенноеЗначение("Справочник.ВидыОтчетов.КПНиНДС");

	Для М = 8 По ВсегоСтрок Цикл
		Если СокрЛП(ТекОтчет.Область(М, 2).Text) = "" Тогда
			Продолжить;
		КонецЕсли;
		ЗагрузитьСтрокуКПНиНДС(ТекОтчет, М, ВидОтчета);		
	КонецЦикла;	
				
КонецПроцедуры

//&НаКлиенте
Процедура ЗагрузитьСтрокуКПНиНДС(ТекОтчет, Строка, ВидОтчета)
	
	СтрокаОтчета = ПолучитьСтрокуОтчета(ВидОтчета, СокрЛП(ТекОтчет.Область(Строка, 2).Text));

	Ключи = Новый Структура;
	Ключи.Вставить("ТипНалога", СокрЛП(ТекОтчет.Область(Строка, 2).Text));	
	
	КлючАналитики = Неопределено;
	
	Для Н = 3 По 14 Цикл
		
		Если ТекОтчет.Область(7, Н).СодержитЗначение Тогда 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).Значение);
		Иначе 
			Период = ПолучитьПериод(ТекОтчет.Область(7, Н).текст);
		КонецЕсли;
		Если ТекОтчет.Область(Строка, Н).СодержитЗначение Тогда 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).Значение);
		Иначе 
			Сумма = ПолучитьЧисло(ТекОтчет.Область(Строка, Н).текст);
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			Если КлючАналитики = Неопределено Тогда
				КлючАналитики = ПолучитьКлючАналитики(СтрокаОтчета, Ключи);
			КонецЕсли;

			НовСтрока = Объект.ДанныеОтчетов.Добавить();
			НовСтрока.ВидОтчета = ВидОтчета;
			НовСтрока.СтрокаОтчета = СтрокаОтчета;
			НовСтрока.АналитикаСтрокиОтчета = КлючАналитики;
			НовСтрока.Период = Период;
			НовСтрока.Сумма = Сумма;
			НовСтрока.Валюта = "KZT";
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры
//КПН и НДС
